RhinoInside.Revit API Documentation
GeometryDecoder.ToBrep Method (Solid)
 Converts the specified Autodesk.Revit.DB.Solid to an equivalent Rhino.Geometry.Brep.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Rhino.Geometry.Brep ToBrep(
	this Autodesk.Revit.DB.Solid solid
)
@staticmethod
def ToBrep(
	solid: Autodesk.Revit.DB.Solid
) -> Rhino.Geometry.Brep
Parameters
solid
Type: Autodesk.Revit.DB.Solid
Revit solid to convert.
Return Value
Type: Rhino.Geometry.Brep
Rhino brep that is equivalent to the provided Revit solid.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Solid. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToBrep(Solid) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Brep rhinoBrep = revitSolid.ToBrep();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_brep = revit_solid.ToBrep() # type: RG.Brep
 Using ToBrep(Solid) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Brep rhinoBrep = GeometryEncoder.ToBrep(revitSolid)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_brep = GD.ToBrep(revit_solid) # type: RG.Brep
See Also
Reference
GeometryDecoder Class
ToBrep Overload
RhinoInside.Revit.Convert.Geometry Namespace